tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "oven-sh/bun"
brew "bat"
brew "cmake"
brew "eza"
brew "flyctl"
brew "fnm"
brew "gh"
brew "gibo"
brew "git"
brew "ipfs"
brew "ipython"
brew "jq"
brew "just"
brew "libomp"
brew "lightgbm"
brew "pkg-config"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "rm-improved"
brew "rye"
brew "sheldon"
brew "sshuttle"
brew "streamlink"
brew "ta-lib"
brew "tmux"
brew "topgrade"
brew "you-get"
brew "youtube-dl"
brew "yt-dlp"
brew "oven-sh/bun/bun"
cask "alt-tab"
cask "arc"
cask "box-tools"
cask "brave-browser"
cask "chromium"
cask "deepl"
cask "discord"
cask "figma"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "opera"
cask "pitch"
cask "resolutionator"
cask "slack"
cask "telegram"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vivaldi"
cask "yippy"
cask "zoom"
vscode "aeschli.vscode-css-formatter"
vscode "amatlash.json-schema-validation-tool"
vscode "ambar.bundle-size"
vscode "be5invis.toml"
vscode "biomejs.biome"
vscode "bonprosoft.pysen-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "damirka.move-syntax"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dprint.dprint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "evilz.vscode-reveal"
vscode "fabiospampinato.vscode-diff"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gregoire.cranelift"
vscode "gruntfuggly.todo-tree"
vscode "gruntfuggly.triggertaskonsave"
vscode "iden3.circom"
vscode "ikuyadeu.devreplay"
vscode "james-yu.latex-workshop"
vscode "jashoo.dotnetinsights"
vscode "jebbs.plantuml"
vscode "josetr.cmake-language-support-vscode"
vscode "juanblanco.solidity"
vscode "julialang.language-julia"
vscode "kevinkassimo.cargo-toml-snippets"
vscode "leetcode.vscode-leetcode"
vscode "lonefy.vscode-js-css-html-formatter"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mimium-org.mimium-language"
vscode "move.move-analyzer"
vscode "movebit.move-msl-syx"
vscode "mrmlnc.vscode-autoprefixer"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "nmrmsys.vscode-sql-formatter-mod"
vscode "noir-lang.vscode-noir"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "qingpeng.common-lisp"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust"
vscode "rust-lang.rust-analyzer"
vscode "s-nlf-fh.glassit"
vscode "shakram02.bash-beautify"
vscode "shardulm94.trailing-spaces"
vscode "sidneys1.gitconfig"
vscode "silvenon.mdx"
vscode "skellock.just"
vscode "softaware.abc-music"
vscode "solidjs-community.solid-snippets"
vscode "tabnine.tabnine-vscode"
vscode "taizod1024.ac-ts-extension"
vscode "tamasfe.even-better-toml"
vscode "tintinweb.vscode-circom-pro"
vscode "tsandall.opa"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vampire-theme.vampire-theme"
vscode "vlanguage.vscode-vlang"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "zignd.html-css-class-completion"
vscode "znck.grammarly"
vscode "zobo.php-intellisense"
